"Close" = "Stäng";

"Scan Card" = "Skanna kort";

"Scan card" = "Skanna kort";

"The IBAN you entered is invalid." = "Angivet IBAN är ogiltigt.";

"There was an error processing your card -- try again in a few seconds" = "Ett fel uppstod vid behandlingen av ditt kort - försök igen om ett par sekunder";

"There was an unexpected error -- try again in a few seconds" = "Ett oväntat fel uppstod - försök igen om ett par sekunder";

"Try again" = "Försök igen";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "Vi använder Stripe för att verifiera dina kortuppgifter. Stripe kan komma att använda och lagra dina uppgifter i enlighet med sin integritetspolicy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Läs mer</u></a>";

"Your card has expired" = "Kortet har löpt ut";

"Your card was declined" = "Ditt kort nekades";

"Your card's expiration month is invalid" = "Kortets utgångsmånad är ogiltig";

"Your card's expiration year is invalid" = "Kortets utgångsår är ogiltigt";

"Your card's number is invalid" = "Kortnumret är ogiltigt";

"Your card's security code is invalid" = "Kortets säkerhetskod är ogiltig";

"Your name is invalid." = "Ditt namn är ogiltigt.";

"Your payment method was declined." = "Din betalningsmetod godkändes inte.";
